Repository: AFCVentura/ghibli-fan-tribute
Catalog: Resources/SharedResources.*.resx
Languages: pt_br

# NavGhibliFigures
source: Notable Figures
pt_br: Figuras Notáveis

# NavGhibliHistory
source: Ghibli's History
pt_br: História do Ghibli

# NavFilms
source: Films
pt_br: Filmes

# NavFilmsFilmography
source: Filmography
pt_br: Filmografia

# NavFilmsCharacters
source: Characters
pt_br: Personagens

# NavFilmsOthers
source: Others
pt_br: Outros

# NavAboutme
source: About Me
pt_br: Sobre Mim

# NavAboutmeWhoAmI
source: Who Am I
pt_br: Quem Sou Eu

# NavAboutmeMyResume
source: My Resume
pt_br: Meu Currículo

# NavAboutmeMyPortfolio
source: My Portfolio
pt_br: Meu Portifólio

# NavAboutmeTechStack
source: Tech Stack
pt_br: Stack Tecnológico

# NavContact
source: Contact
pt_br: Contato

# NavThemeLight
source: Light
pt_br: Claro

# NavThemeDark
source: Dark
pt_br: Escuro

# NavThemeSystem
source: System
pt_br: Sistema

# HeroFanTribute
source: A Fan Tribute to
pt_br: Uma Homenagem de Fã para o

# HeroMadeBy
source: Made By Ventura
pt_br: Feita por Ventura

# HeroButton
source: Learn More About Ghibli
pt_br: Saiba Mais Sobre o Ghibli

# QuotePhrase
source: "I would like to make a film to tell children 'it's good to be alive'."
pt_br: "Gostaria de fazer um filme para dizer às crianças: 'é bom estar vivo'."

# AboutGhibliPreviewText
source: Studio Ghibli is a renowned Japanese animation studio, known for its poetic, visually striking, and emotionally profound films. Founded in 1985 by animation masters Hayao Miyazaki and Isao Takahata, with production by Toshio Suzuki and financial support from Yasuyoshi Tokuma, the studio quickly became a global reference in auteur animation. Its works blend human themes, nature, fantasy, and social commentary, resonating with generations around the world.
pt_br: O Studio Ghibli é um renomado estúdio japonês de animação, conhecido por seus filmes poéticos, visualmente marcantes e emocionalmente profundos. Fundado em 1985 pelos mestres da animação Hayao Miyazaki e Isao Takahata, com produção de Toshio Suzuki e apoio financeiro de Yasuyoshi Tokuma, o estúdio rapidamente se tornou uma referência mundial em animação autoral. Suas obras mesclam temas humanos, natureza, fantasia e crítica social, ressoando com gerações ao redor do mundo.

# AboutGhibliPreviewTitle
source: About Studio Ghibli
pt_br: Sobre o Estúdio Ghibli

# AboutGhibliPreviewButton
source: Full History and Directors
pt_br: História Completa e Diretores

# SpiritedAwayTitle
source: Spirited Away
pt_br: A Viagem de Chihiro

# TheBoyAndTheHeronTitle
source: The Boy and the Heron
pt_br: O Menino e a Garça

# MyNeighborTotoroTitle
source: My Neighbor Totoro
pt_br: Meu Vizinho Totoro

# GraveOfTheFirefliesTitle
source: Grave of the Fireflies
pt_br: O Túmulo dos Vagalumes

# PrincessMononokeTitle
source: Princess Mononoke
pt_br: Princesa Mononoke

# SpiritedAwayPreviewDescription
source: A young girl enters a magical world ruled by gods, witches, and spirits, and must save her parents in this Oscar-winning masterpiece.
pt_br: Uma jovem entra em um mundo mágico governado por deuses, bruxas e espíritos, e precisa salvar seus pais nesta obra-prima vencedora do Oscar.

# TheBoyAndTheHeronPreviewDescription
source: A boy grieving his mother discovers a hidden world guided by a mysterious heron, in Hayao Miyazaki’s Academy Award–winning tale of loss and wonder.
pt_br: Um garoto em luto pela mãe descobre um mundo oculto guiado por uma misteriosa garça, no conto de perda e maravilha vencedor do Oscar de Hayao Miyazaki.

# GraveOfTheFirefliesPreviewDescription
source: Two siblings struggle to survive amidst war-torn Japan, in this heartbreaking and critically acclaimed masterpiece.
pt_br: Dois irmãos lutam para sobreviver em meio ao Japão devastado pela guerra, nesta obra-prima comovente e aclamada pela crítica.

# PrincessMononokePreviewDescription
source: A warrior cursed by a deadly spirit is drawn into a fierce struggle between humans and the gods of the forest in this award-winning epic.
pt_br: Um guerreiro amaldiçoado por um espírito mortal é levado a uma intensa batalha entre humanos e os deuses da floresta nesta épica produção premiada.

# MyNeighborTotoroPreviewDescription
source: Two sisters move to the countryside and encounter gentle forest spirits, in this beloved and enchanting Studio Ghibli classic.
pt_br: Duas irmãs se mudam para o campo e encontram gentis espíritos da floresta, neste adorado e encantador clássico do Studio Ghibli.

# AwardsSectionButton
source: Explore All Movies
pt_br: Explore Todos os Filmes

# AwardsSectionTitle
source: Award Winning Works
pt_br: Trabalhos Premiados

# AboutSectionTitle
source: About
pt_br: Sobre

# AboutSectionProjectTitle
source: About the Project
pt_br: Sobre o Projeto

# AboutSectionMeTitle
source: About Me
pt_br: Sobre Mim

# AboutSectionMeText
source: .NET developer focused on ASP.NET Core, Blazor, and clean architectures, passionate about turning ideas into well-structured, reliable digital experiences. I have hands-on experience with professional, academic and personal projects covering both back-end and front-end development, always emphasizing good practices, organization, and usability. I’m continuously expanding my skills by exploring technologies like .NET MAUI, React, Azure, and databases such as SQL Server and MySQL. Beyond technical proficiency, I value intuitive design, clear communication, and delivering solutions that combine performance and visual refinement.
pt_br: Desenvolvedor .NET com foco em ASP.NET Core, Blazor e arquiteturas limpas, apaixonado por transformar ideias em experiências digitais sólidas e bem estruturadas. Tenho experiência em projetos profissionais, acadêmicos e pessoais que envolvem desde o back-end até o front-end, com ênfase em boas práticas, organização e usabilidade. Busco constantemente expandir meus conhecimentos, explorando tecnologias como .NET MAUI, React, Azure e integração com bancos de dados como SQL Server e MySQL. Além do lado técnico, valorizo o design intuitivo, a clareza na comunicação e a entrega de soluções que unem performance e estética.

# AboutSectionProjectText
source: Front-end project developed with Blazor Server, designed to enhance practical skills and serve as a professional portfolio piece. The application explores UI/UX design principles, emphasizing clean structure, component reusability, and full responsiveness. Inspired by the magical universe of Studio Ghibli’s films, the project aims to capture the studio’s distinctive atmosphere and visual storytelling through a smooth, elegant, and user-friendly interface — blending minimalist design with cosiness.
pt_br: Projeto de front-end desenvolvido com Blazor Server, criado com o objetivo de aprimorar habilidades práticas e compor o portfólio profissional. A aplicação foi construída para explorar princípios de design de interface e experiência do usuário (UI/UX), aplicando boas práticas de estrutura, componentização e responsividade. Inspirado no universo dos filmes do Studio Ghibli, o projeto busca transmitir a atmosfera poética e visual marcante do estúdio através de uma interface limpa, fluida e acessível, combinando estética minimalista e aconchego.

# AboutSectionProjectButton
source: See Project's Complete Tech Stack
pt_br: Ver Stack Tecnológica Completa do Projeto

# AboutSectionMeButton
source: See More About Me
pt_br: Ver Mais Sobre Mim

# AboutSectionGenericText
source: Select an option above.
pt_br: Selecione uma opção acima.

# FooterDisclaimerPart1
source: This website was developed by
pt_br: Este site foi desenvolvido por

# FooterDisclaimerPart3
source: for educational purposes. It uses data from the
pt_br: para propósitos educacionais. Ele usa dados da

# FooterDisclaimerPart4
source: Studio Ghibli API
pt_br: API do Studio Ghibli

# FooterDisclaimerPart5
source: , which is not affiliated with Studio Ghibli. Neither this site nor the API claims any rights to Studio Ghibli’s intellectual property.
pt_br: , que não é afiliada ao Studio Ghibli. Nem esse site nem a API reivindicam quaisquer direitos à propriedade intelectual do Studio Ghibli.

# FooterPrivacyPolicyButton
source: Privacy Policy
pt_br: Política de Privacidade

# ResumePath
source: files/JoaoVitorVenturaResumeEnglish.pdf
pt_br: files/JoaoVitorVenturaResumePortugues.pdf
